// ABOBA V0.3.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
using namespace std;
int main()
{
    setlocale(LC_ALL, "rus");
    int Chisl0 = 0;
    cout << "Введи число которое надо перевести(от 1 до 9999)";
    cin >> Chisl0;
    cout << Chisl0 / 10;
    if (Chisl0 <= 0 || Chisl0 > 9999) {
        cout << "ты ебобо?\n";
    }
    if ((Chisl0 / 1000) % 10 == 1) {
        cout << "Одна тысяча ";
    }
    else if ((Chisl0 / 1000) % 10 == 2) {
        cout << "Две тысячи ";
    }
    else if ((Chisl0 / 1000) % 10 == 3) {
        cout << "Три тысячи ";
    }
    else if ((Chisl0 / 1000) % 10 == 4) {
        cout << "Четыре тысячи ";
    }
    else if ((Chisl0 / 1000) % 10 == 5) {
        cout << "Пять тысяч ";
    }
    else if ((Chisl0 / 1000) % 10 == 6) {
        cout << "Шесть тысяч ";
    }
    else if ((Chisl0 / 1000) % 10 == 7) {
        cout << "Семь тысяч ";
    }
    else if ((Chisl0 / 1000) % 10 == 8) {
        cout << "Восемь тысяч ";
    }
    else if ((Chisl0 / 1000) % 10 == 9) {
        cout << "Девять тысяч ";
    }
    if ((Chisl0 / 100) % 10 == 1) {
        cout << "сто ";
    }
    else if ((Chisl0 / 100) % 10 == 2) {
        cout << "двесте ";
    }
    else if ((Chisl0 / 100) % 10 == 3) {
        cout << "триста ";
    }
    else if ((Chisl0 / 100) % 10 == 4) {
        cout << "четыреста ";
    }
    else if ((Chisl0 / 100) % 10 == 5) {
        cout << "пятьсот ";
    }
    else if ((Chisl0 / 100) % 10 == 6) {
        cout << "шестьсот ";
    }
    else if ((Chisl0 / 100) % 10 == 7) {
        cout << "семьсот ";
    }
    else if ((Chisl0 / 100) % 10 == 8) {
        cout << "восемьсот ";
    }
    else if ((Chisl0 / 100) % 10 == 9) {
        cout << "девятьсот ";
    }
    if ((Chisl0 / 10) >= 10 && (Chisl0 / 10) <= 19) {
        if ((Chisl0 / 1) % 10 == 1) {
            cout << "одиннадцать ";
        }
        else if ((Chisl0 / 1) % 10 == 0) {
            cout << "десять ";
        }
        else if ((Chisl0 / 1) % 10 == 2) {
            cout << "двеннадцать ";
        }
        else if ((Chisl0 / 1) % 10 == 3) {
            cout << "тринадцать ";
        }
        else if ((Chisl0 / 1) % 10 == 4) {
            cout << "четырнадцать ";
        }
        else if ((Chisl0 / 1) % 10 == 5) {
            cout << "пятнадцать ";
        }
        else if ((Chisl0 / 1) % 10 == 6) {
            cout << "шестнадцать ";
        }
        else if ((Chisl0 / 1) % 10 == 7) {
            cout << "семнадцать ";
        }
        else if ((Chisl0 / 1) % 10 == 8) {
            cout << "восемьнадцать ";
        }
        else if ((Chisl0 / 1) % 10 == 9) {
            cout << "девятнадцать ";
        }
    }
    if ((Chisl0 / 10) >= 20 && (Chisl0 / 10) <= 29) {
        if ((Chisl0 / 1) % 10 == 1) {
            cout << "двадцать один ";
        }
        else if ((Chisl0 / 1) % 10 == 0) {
            cout << "двадцать ";
        }
        else if ((Chisl0 / 1) % 10 == 2) {
            cout << "двадцать два ";
        }
        else if ((Chisl0 / 1) % 10 == 3) {
            cout << "двадцать три ";
        }
        else if ((Chisl0 / 1) % 10 == 4) {
            cout << "двадцать четыре ";
        }
        else if ((Chisl0 / 1) % 10 == 5) {
            cout << "двадцать пять ";
        }
        else if ((Chisl0 / 1) % 10 == 6) {
            cout << "двадцать шесть ";
        }
        else if ((Chisl0 / 1) % 10 == 7) {
            cout << "двадцать семь ";
        }
        else if ((Chisl0 / 1) % 10 == 8) {
            cout << "двадцать восемь ";
        }
        else if ((Chisl0 / 1) % 10 == 9) {
            cout << "двадцать девять ";
        }
    }
    if ((Chisl0 / 10) >= 30 && (Chisl0 / 10) <= 39) {
        if ((Chisl0 / 1) % 10 == 1) {
            cout << "тридцать один ";
        }
        else if ((Chisl0 / 1) % 10 == 0) {
            cout << "тридцать ";
        }
        else if ((Chisl0 / 1) % 10 == 2) {
            cout << "тридцать два ";
        }
        else if ((Chisl0 / 1) % 10 == 3) {
            cout << "тридцать три ";
        }
        else if ((Chisl0 / 1) % 10 == 4) {
            cout << "тридцать четыре ";
        }
        else if ((Chisl0 / 1) % 10 == 5) {
            cout << "тридцать пять ";
        }
        else if ((Chisl0 / 1) % 10 == 6) {
            cout << "тридцать шесть ";
        }
        else if ((Chisl0 / 1) % 10 == 7) {
            cout << "тридцать семь ";
        }
        else if ((Chisl0 / 1) % 10 == 8) {
            cout << "тридцать восемь ";
        }
        else if ((Chisl0 / 1) % 10 == 9) {
            cout << "тридцать девять ";
        }
    }
    if ((Chisl0 / 10) >= 10 && (Chisl0 / 40) <= 49) {
        if ((Chisl0 / 1) % 10 == 1) {
            cout << "сорок один ";
        }
        else if ((Chisl0 / 1) % 10 == 0) {
            cout << "сорок  ";
        }
        else if ((Chisl0 / 1) % 10 == 2) {
            cout << "двеннадцать ";
        }
        else if ((Chisl0 / 1) % 10 == 3) {
            cout << "тринадцать ";
        }
        else if ((Chisl0 / 1) % 10 == 4) {
            cout << "четырнадцать ";
        }
        else if ((Chisl0 / 1) % 10 == 5) {
            cout << "пятнадцать ";
        }
        else if ((Chisl0 / 1) % 10 == 6) {
            cout << "шестнадцать ";
        }
        else if ((Chisl0 / 1) % 10 == 7) {
            cout << "семнадцать ";
        }
        else if ((Chisl0 / 1) % 10 == 8) {
            cout << "восемьнадцать ";
        }
        else if ((Chisl0 / 1) % 10 == 9) {
            cout << "девятнадцать ";
        }
    }
    if ((Chisl0 / 10) >= 50 && (Chisl0 / 10) <= 59) {
        if ((Chisl0 / 1) % 10 == 1) {
            cout << "одиннадцать ";
        }
        else if ((Chisl0 / 1) % 10 == 0) {
            cout << "десять";
        }
        else if ((Chisl0 / 1) % 10 == 2) {
            cout << "двеннадцать ";
        }
        else if ((Chisl0 / 1) % 10 == 3) {
            cout << "тринадцать ";
        }
        else if ((Chisl0 / 1) % 10 == 4) {
            cout << "четырнадцать ";
        }
        else if ((Chisl0 / 1) % 10 == 5) {
            cout << "пятнадцать ";
        }
        else if ((Chisl0 / 1) % 10 == 6) {
            cout << "шестнадцать ";
        }
        else if ((Chisl0 / 1) % 10 == 7) {
            cout << "семнадцать ";
        }
        else if ((Chisl0 / 1) % 10 == 8) {
            cout << "восемьнадцать ";
        }
        else if ((Chisl0 / 1) % 10 == 9) {
            cout << "девятнадцать ";
        }
    }
    if ((Chisl0 / 10) >= 60 && (Chisl0 / 10) <= 69) {
        if ((Chisl0 / 1) % 10 == 1) {
            cout << "одиннадцать ";
        }
        else if ((Chisl0 / 1) % 10 == 0) {
            cout << "десять";
        }
        else if ((Chisl0 / 1) % 10 == 2) {
            cout << "двеннадцать ";
        }
        else if ((Chisl0 / 1) % 10 == 3) {
            cout << "тринадцать ";
        }
        else if ((Chisl0 / 1) % 10 == 4) {
            cout << "четырнадцать ";
        }
        else if ((Chisl0 / 1) % 10 == 5) {
            cout << "пятнадцать ";
        }
        else if ((Chisl0 / 1) % 10 == 6) {
            cout << "шестнадцать ";
        }
        else if ((Chisl0 / 1) % 10 == 7) {
            cout << "семнадцать ";
        }
        else if ((Chisl0 / 1) % 10 == 8) {
            cout << "восемьнадцать ";
        }
        else if ((Chisl0 / 1) % 10 == 9) {
            cout << "девятнадцать ";
        }
    }
    if ((Chisl0 / 10) >= 70 && (Chisl0 / 10) <= 79) {
        if ((Chisl0 / 1) % 10 == 1) {
            cout << "одиннадцать ";
        }
        else if ((Chisl0 / 1) % 10 == 0) {
            cout << "десять";
        }
        else if ((Chisl0 / 1) % 10 == 2) {
            cout << "двеннадцать ";
        }
        else if ((Chisl0 / 1) % 10 == 3) {
            cout << "тринадцать ";
        }
        else if ((Chisl0 / 1) % 10 == 4) {
            cout << "четырнадцать ";
        }
        else if ((Chisl0 / 1) % 10 == 5) {
            cout << "пятнадцать ";
        }
        else if ((Chisl0 / 1) % 10 == 6) {
            cout << "шестнадцать ";
        }
        else if ((Chisl0 / 1) % 10 == 7) {
            cout << "семнадцать ";
        }
        else if ((Chisl0 / 1) % 10 == 8) {
            cout << "восемьнадцать ";
        }
        else if ((Chisl0 / 1) % 10 == 9) {
            cout << "девятнадцать ";
        }
    }
    if ((Chisl0 / 10) >= 80 && (Chisl0 / 10) <= 89) {
        if ((Chisl0 / 1) % 10 == 1) {
            cout << "одиннадцать ";
        }
        else if ((Chisl0 / 1) % 10 == 0) {
            cout << "десять";
        }
        else if ((Chisl0 / 1) % 10 == 2) {
            cout << "двеннадцать ";
        }
        else if ((Chisl0 / 1) % 10 == 3) {
            cout << "тринадцать ";
        }
        else if ((Chisl0 / 1) % 10 == 4) {
            cout << "четырнадцать ";
        }
        else if ((Chisl0 / 1) % 10 == 5) {
            cout << "пятнадцать ";
        }
        else if ((Chisl0 / 1) % 10 == 6) {
            cout << "шестнадцать ";
        }
        else if ((Chisl0 / 1) % 10 == 7) {
            cout << "семнадцать ";
        }
        else if ((Chisl0 / 1) % 10 == 8) {
            cout << "восемьнадцать ";
        }
        else if ((Chisl0 / 1) % 10 == 9) {
            cout << "девятнадцать ";
        }
    }
    if ((Chisl0 / 10) >= 90 && (Chisl0 / 10) <= 99) {
        if ((Chisl0 / 1) % 10 == 1) {
            cout << "одиннадцать ";
        }
        else if ((Chisl0 / 1) % 10 == 0) {
            cout << "десять";
        }
        else if ((Chisl0 / 1) % 10 == 2) {
            cout << "двеннадцать ";
        }
        else if ((Chisl0 / 1) % 10 == 3) {
            cout << "тринадцать ";
        }
        else if ((Chisl0 / 1) % 10 == 4) {
            cout << "четырнадцать ";
        }
        else if ((Chisl0 / 1) % 10 == 5) {
            cout << "пятнадцать ";
        }
        else if ((Chisl0 / 1) % 10 == 6) {
            cout << "шестнадцать ";
        }
        else if ((Chisl0 / 1) % 10 == 7) {
            cout << "семнадцать ";
        }
        else if ((Chisl0 / 1) % 10 == 8) {
            cout << "восемьнадцать ";
        }
        else if ((Chisl0 / 1) % 10 == 9) {
            cout << "девятнадцать ";
        }
    }

    


   

    return 0;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
